# RbsDuctPressureDrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsDuctPressureDrop Property
ParameterTypeId Class See Also
---
"Pressure Drop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsDuctPressureDrop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsDuctPressureDrop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsDuctPressureDrop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace